platforms/Case_Studies/Periodic_Hill/00Baseline/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (0   1.0    -.1  )//0
        (9   1.0    -.1  )//1
        (9   2.0    -.1  )//2
        (0   2.0    -.1  )//3
        (0   1.0     .1  )//4
        (9   1.0     .1  )//5
        (9   2.0     .1  )//6
        (0   2.0     .1  )//7
        (9   3.035  -.1  )//8
        (0   3.035  -.1  )//9
        (0   3.035   .1  )//10
        (9   3.035   .1  )//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (120 65 1) simpleGrading (1 10 1)
        hex (3 2 8 9 7 6 11 10) (120 65 1) simpleGrading (1 .1 1)
);

/*
edges
(
      spline 0 1 ((0.25 -0.1 0.1))
      spline 3 2 ((0.75  0.1 0.1))
);
*/

//EDGES-START
edges
(
spline 0 1 (
(0.0 1.0 -.1 )
(0.00900900900901 1.0 -.1 )
(0.018018018018 1.0 -.1 )
(0.027027027027 1.0 -.1 )
(0.036036036036 1.0 -.1 )
(0.045045045045 1.0 -.1 )
(0.0540540540541 1.0 -.1 )
(0.0630630630631 1.0 -.1 )
(0.0720720720721 1.0 -.1 )
(0.0810810810811 1.0 -.1 )
(0.0900900900901 1.0 -.1 )
(0.0990990990991 1.0 -.1 )
(0.108108108108 1.0 -.1 )
(0.117117117117 0.999926318545 -.1 )
(0.126126126126 0.999675839701 -.1 )
(0.135135135135 0.999353851027 -.1 )
(0.144144144144 0.998953045159 -.1 )
(0.153153153153 0.998466114731 -.1 )
(0.162162162162 0.997885752378 -.1 )
(0.171171171171 0.997204650737 -.1 )
(0.18018018018 0.996415502442 -.1 )
(0.189189189189 0.995511000128 -.1 )
(0.198198198198 0.99448383643 -.1 )
(0.207207207207 0.993326703984 -.1 )
(0.216216216216 0.992032295425 -.1 )
(0.225225225225 0.990593303388 -.1 )
(0.234234234234 0.989002420508 -.1 )
(0.243243243243 0.98725233942 -.1 )
(0.252252252252 0.98533575276 -.1 )
(0.261261261261 0.983245353162 -.1 )
(0.27027027027 0.980973833263 -.1 )
(0.279279279279 0.978513885696 -.1 )
(0.288288288288 0.975858203098 -.1 )
(0.297297297297 0.972999478103 -.1 )
(0.306306306306 0.969930403346 -.1 )
(0.315315315315 0.966643671464 -.1 )
(0.324324324324 0.963132051511 -.1 )
(0.333333333333 0.959393316811 -.1 )
(0.342342342342 0.95543324833 -.1 )
(0.351351351351 0.951258346061 -.1 )
(0.36036036036 0.946875110001 -.1 )
(0.369369369369 0.942290040143 -.1 )
(0.378378378378 0.937509636482 -.1 )
(0.387387387387 0.932540399013 -.1 )
(0.396396396396 0.92738882773 -.1 )
(0.405405405405 0.922061422629 -.1 )
(0.414414414414 0.916564683703 -.1 )
(0.423423423423 0.910905110947 -.1 )
(0.432432432432 0.905089204356 -.1 )
(0.441441441441 0.899123463925 -.1 )
(0.45045045045 0.893014389649 -.1 )
(0.459459459459 0.886768481521 -.1 )
(0.468468468468 0.880392239536 -.1 )
(0.477477477477 0.87389216369 -.1 )
(0.486486486486 0.867274753976 -.1 )
(0.495495495495 0.86054651039 -.1 )
(0.504504504505 0.85371391406 -.1 )
(0.513513513514 0.846783012194 -.1 )
(0.522522522523 0.839759418081 -.1 )
(0.531531531532 0.832648726145 -.1 )
(0.540540540541 0.825456530806 -.1 )
(0.54954954955 0.818188426489 -.1 )
(0.558558558559 0.810850007615 -.1 )
(0.567567567568 0.803446868607 -.1 )
(0.576576576577 0.795984603888 -.1 )
(0.585585585586 0.788468807879 -.1 )
(0.594594594595 0.780905075005 -.1 )
(0.603603603604 0.773298999686 -.1 )
(0.612612612613 0.765656176347 -.1 )
(0.621621621622 0.757982199408 -.1 )
(0.630630630631 0.750282663294 -.1 )
(0.63963963964 0.742563162426 -.1 )
(0.648648648649 0.734829291228 -.1 )
(0.657657657658 0.72708664412 -.1 )
(0.666666666667 0.719340815527 -.1 )
(0.675675675676 0.711597399871 -.1 )
(0.684684684685 0.703861991574 -.1 )
(0.693693693694 0.696140185059 -.1 )
(0.702702702703 0.688437574749 -.1 )
(0.711711711712 0.680759755065 -.1 )
(0.720720720721 0.673111937382 -.1 )
(0.72972972973 0.665495570003 -.1 )
(0.738738738739 0.657909965352 -.1 )
(0.747747747748 0.650354411339 -.1 )
(0.756756756757 0.642828195871 -.1 )
(0.765765765766 0.635330606858 -.1 )
(0.774774774775 0.627860932208 -.1 )
(0.783783783784 0.62041845983 -.1 )
(0.792792792793 0.613002477633 -.1 )
(0.801801801802 0.605612273526 -.1 )
(0.810810810811 0.598247135417 -.1 )
(0.81981981982 0.590906351215 -.1 )
(0.828828828829 0.58358920883 -.1 )
(0.837837837838 0.576294996169 -.1 )
(0.846846846847 0.569023001141 -.1 )
(0.855855855856 0.561772511656 -.1 )
(0.864864864865 0.554542815622 -.1 )
(0.873873873874 0.547333200948 -.1 )
(0.882882882883 0.540142955543 -.1 )
(0.891891891892 0.532971367315 -.1 )
...
)
spline 4 5 (
(0.0 1.0  .1)
(0.00900900900901 1.0  .1)
(0.018018018018 1.0  .1)
(0.027027027027 1.0  .1)
(0.036036036036 1.0  .1)
(0.045045045045 1.0  .1)
(0.0540540540541 1.0  .1)
(0.0630630630631 1.0  .1)
(0.0720720720721 1.0  .1)
(0.0810810810811 1.0  .1)
(0.0900900900901 1.0  .1)
(0.0990990990991 1.0  .1)
(0.108108108108 1.0  .1)
(0.117117117117 0.999926318545  .1)
(0.126126126126 0.999675839701  .1)
(0.135135135135 0.999353851027  .1)
(0.144144144144 0.998953045159  .1)
(0.153153153153 0.998466114731  .1)
(0.162162162162 0.997885752378  .1)
(0.171171171171 0.997204650737  .1)
(0.18018018018 0.996415502442  .1)
(0.189189189189 0.995511000128  .1)
(0.198198198198 0.99448383643  .1)
(0.207207207207 0.993326703984  .1)
(0.216216216216 0.992032295425  .1)
(0.225225225225 0.990593303388  .1)
(0.234234234234 0.989002420508  .1)
(0.243243243243 0.98725233942  .1)
(0.252252252252 0.98533575276  .1)
(0.261261261261 0.983245353162  .1)
(0.27027027027 0.980973833263  .1)
(0.279279279279 0.978513885696  .1)
(0.288288288288 0.975858203098  .1)
(0.297297297297 0.972999478103  .1)
(0.306306306306 0.969930403346  .1)
(0.315315315315 0.966643671464  .1)
(0.324324324324 0.963132051511  .1)
(0.333333333333 0.959393316811  .1)
(0.342342342342 0.95543324833  .1)
(0.351351351351 0.951258346061  .1)
(0.36036036036 0.946875110001  .1)
(0.369369369369 0.942290040143  .1)
(0.378378378378 0.937509636482  .1)
(0.387387387387 0.932540399013  .1)
(0.396396396396 0.92738882773  .1)
(0.405405405405 0.922061422629  .1)
(0.414414414414 0.916564683703  .1)
(0.423423423423 0.910905110947  .1)
(0.432432432432 0.905089204356  .1)
(0.441441441441 0.899123463925  .1)
(0.45045045045 0.893014389649  .1)
(0.459459459459 0.886768481521  .1)
(0.468468468468 0.880392239536  .1)
(0.477477477477 0.87389216369  .1)
(0.486486486486 0.867274753976  .1)
(0.495495495495 0.86054651039  .1)
(0.504504504505 0.85371391406  .1)
(0.513513513514 0.846783012194  .1)
(0.522522522523 0.839759418081  .1)
(0.531531531532 0.832648726145  .1)
(0.540540540541 0.825456530806  .1)
(0.54954954955 0.818188426489  .1)
(0.558558558559 0.810850007615  .1)
(0.567567567568 0.803446868607  .1)
(0.576576576577 0.795984603888  .1)
(0.585585585586 0.788468807879  .1)
(0.594594594595 0.780905075005  .1)
(0.603603603604 0.773298999686  .1)
(0.612612612613 0.765656176347  .1)
(0.621621621622 0.757982199408  .1)
(0.630630630631 0.750282663294  .1)
(0.63963963964 0.742563162426  .1)
(0.648648648649 0.734829291228  .1)
(0.657657657658 0.72708664412  .1)
(0.666666666667 0.719340815527  .1)
(0.675675675676 0.711597399871  .1)
(0.684684684685 0.703861991574  .1)
(0.693693693694 0.696140185059  .1)
(0.702702702703 0.688437574749  .1)
(0.711711711712 0.680759755065  .1)
(0.720720720721 0.673111937382  .1)
(0.72972972973 0.665495570003  .1)
(0.738738738739 0.657909965352  .1)
(0.747747747748 0.650354411339  .1)
(0.756756756757 0.642828195871  .1)
(0.765765765766 0.635330606858  .1)
(0.774774774775 0.627860932208  .1)
(0.783783783784 0.62041845983  .1)
(0.792792792793 0.613002477633  .1)
(0.801801801802 0.605612273526  .1)
(0.810810810811 0.598247135417  .1)
(0.81981981982 0.590906351215  .1)
(0.828828828829 0.58358920883  .1)
(0.837837837838 0.576294996169  .1)
(0.846846846847 0.569023001141  .1)
(0.855855855856 0.561772511656  .1)
(0.864864864865 0.554542815622  .1)
(0.873873873874 0.547333200948  .1)
(0.882882882883 0.540142955543  .1)
(0.891891891892 0.532971367315  .1)
...
);
//EDGES-END
//EDGES-END
//EDGES-END


boundary
(
    bottomWall
    {
        type            wall;
        faces           ((4 0 1 5));
    }
    topWall
    {
        type            wall;
        faces           ((10 11 8 9));
    }

    inlet_half0
    {
        type            cyclic;
        neighbourPatch  outlet_half0;
        faces           ((7 3 0 4));
    }

    inlet_half1
    {
        type            cyclic;
        neighbourPatch  outlet_half1;
        faces           ((7 10 9 3));
    }

    outlet_half0
    {
        type            cyclic;
        neighbourPatch  inlet_half0;
        faces           ((6 5 1 2));
    }

    outlet_half1
    {
        type            cyclic;
        neighbourPatch  inlet_half1;
        faces           ((11 6 2 8));
    }

    sideRight_half0
    {
        type            empty;
        neighbourPatch  sideLeft_half0;
        faces           ((6 7 4 5));
    }

    sideRight_half1
    {
        type            empty;
        neighbourPatch  sideLeft_half1;
        faces           ((10 7 6 11));
    }

    sideLeft_half0
    {
        type            empty;
        neighbourPatch  sideRight_half0;
        faces           ((0 3 2 1));
    }

    sideLeft_half1
    {
        type            empty;
        neighbourPatch  sideRight_half1;
        faces           ((3 9 8 2));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
